ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/DMASS0_ECC_AGGR_0_ECCAGGR.xml
	<register id="ECCAGGR_REGS_sec_enable_set_reg0" acronym="ECCAGGR_REGS_sec_enable_set_reg0" offset="0x80" width="32" description="Interrupt Enable Set Register 0">
		<bitfield id="SEC_PROXY_BUFRAM_RAMECCC_ENABLE_SET" width="1" begin="26" end="26" resetval="0x0" description="Interrupt Enable Set Register for sec_proxy_bufram_rameccc_pend" range="26" rwaccess="R/W1TS"/> 
		<bitfield id="SEC_PROXY_STRAM_RAMECCC_ENABLE_SET" width="1" begin="25" end="25" resetval="0x0" description="Interrupt Enable Set Register for sec_proxy_stram_rameccc_pend" range="25" rwaccess="R/W1TS"/> 
		<bitfield id="RINGACC_STRAM_RAMECC_ENABLE_SET" width="1" begin="24" end="24" resetval="0x0" description="Interrupt Enable Set Register for ringacc_stram_ramecc_pend" range="24" rwaccess="R/W1TS"/> 
		<bitfield id="MAP_RAMECC_ENABLE_SET" width="1" begin="23" end="23" resetval="0x0" description="Interrupt Enable Set Register for map_ramecc_pend" range="23" rwaccess="R/W1TS"/> 
		<bitfield id="SR_RAMECC_ENABLE_SET" width="1" begin="22" end="22" resetval="0x0" description="Interrupt Enable Set Register for sr_ramecc_pend" range="22" rwaccess="R/W1TS"/> 
		<bitfield id="BCDMA_RNGOCC_RAMECC_ENABLE_SET" width="1" begin="21" end="21" resetval="0x0" description="Interrupt Enable Set Register for bcdma_rngocc_ramecc_pend" range="21" rwaccess="R/W1TS"/> 
		<bitfield id="BCDMA_STS_RAMECC1_ENABLE_SET" width="1" begin="20" end="20" resetval="0x0" description="Interrupt Enable Set Register for bcdma_sts_ramecc1_pend" range="20" rwaccess="R/W1TS"/> 
		<bitfield id="BCDMA_STS_RAMECC0_ENABLE_SET" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Enable Set Register for bcdma_sts_ramecc0_pend" range="19" rwaccess="R/W1TS"/> 
		<bitfield id="BCDMA_RPCF2_RAMECC_ENABLE_SET" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Enable Set Register for bcdma_rpcf2_ramecc_pend" range="18" rwaccess="R/W1TS"/> 
		<bitfield id="BCDMA_RPCF1_RAMECC_ENABLE_SET" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Enable Set Register for bcdma_rpcf1_ramecc_pend" range="17" rwaccess="R/W1TS"/> 
		<bitfield id="BCDMA_RPCF0_RAMECC_ENABLE_SET" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Enable Set Register for bcdma_rpcf0_ramecc_pend" range="16" rwaccess="R/W1TS"/> 
		<bitfield id="BCDMA_TPCF1_RAMECC_ENABLE_SET" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Enable Set Register for bcdma_tpcf1_ramecc_pend" range="15" rwaccess="R/W1TS"/> 
		<bitfield id="BCDMA_TPCF0_RAMECC_ENABLE_SET" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Enable Set Register for bcdma_tpcf0_ramecc_pend" range="14" rwaccess="R/W1TS"/> 
		<bitfield id="PCFD1_RAMECC_ENABLE_SET" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Enable Set Register for pcfd1_ramecc_pend" range="13" rwaccess="R/W1TS"/> 
		<bitfield id="PCFD0_RAMECC_ENABLE_SET" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Enable Set Register for pcfd0_ramecc_pend" range="12" rwaccess="R/W1TS"/> 
		<bitfield id="BCDMA_STATE_RAMECC_ENABLE_SET" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Enable Set Register for bcdma_state_ramecc_pend" range="11" rwaccess="R/W1TS"/> 
		<bitfield id="BCDMA_CFG_RAMECC_ENABLE_SET" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Enable Set Register for bcdma_cfg_ramecc_pend" range="10" rwaccess="R/W1TS"/> 
		<bitfield id="PKTDMA_RNGOCC_RAMECC_ENABLE_SET" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Enable Set Register for pktdma_rngocc_ramecc_pend" range="9" rwaccess="R/W1TS"/> 
		<bitfield id="PKTDMA_STS_RAMECC1_ENABLE_SET" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Set Register for pktdma_sts_ramecc1_pend" range="8" rwaccess="R/W1TS"/> 
		<bitfield id="PKTDMA_STS_RAMECC0_ENABLE_SET" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Set Register for pktdma_sts_ramecc0_pend" range="7" rwaccess="R/W1TS"/> 
		<bitfield id="PKTDMA_RPCF2_RAMECC_ENABLE_SET" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Set Register for pktdma_rpcf2_ramecc_pend" range="6" rwaccess="R/W1TS"/> 
		<bitfield id="PKTDMA_RPCF1_RAMECC_ENABLE_SET" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Set Register for pktdma_rpcf1_ramecc_pend" range="5" rwaccess="R/W1TS"/> 
		<bitfield id="PKTDMA_RPCF0_RAMECC_ENABLE_SET" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Set Register for pktdma_rpcf0_ramecc_pend" range="4" rwaccess="R/W1TS"/> 
		<bitfield id="PKTDMA_TPCF1_RAMECC_ENABLE_SET" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Set Register for pktdma_tpcf1_ramecc_pend" range="3" rwaccess="R/W1TS"/> 
		<bitfield id="PKTDMA_TPCF0_RAMECC_ENABLE_SET" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Set Register for pktdma_tpcf0_ramecc_pend" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="PKTDMA_STATE_RAMECC_ENABLE_SET" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Set Register for pktdma_state_ramecc_pend" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="PKTDMA_CFG_RAMECC_ENABLE_SET" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set Register for pktdma_cfg_ramecc_pend" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="ECCAGGR_REGS_sec_enable_clr_reg0" acronym="ECCAGGR_REGS_sec_enable_clr_reg0" offset="0xC0" width="32" description="Interrupt Enable Clear Register 0">
		<bitfield id="SEC_PROXY_BUFRAM_RAMECCC_ENABLE_CLR" width="1" begin="26" end="26" resetval="0x0" description="Interrupt Enable Clear Register for sec_proxy_bufram_rameccc_pend" range="26" rwaccess="R/W1TC"/> 
		<bitfield id="SEC_PROXY_STRAM_RAMECCC_ENABLE_CLR" width="1" begin="25" end="25" resetval="0x0" description="Interrupt Enable Clear Register for sec_proxy_stram_rameccc_pend" range="25" rwaccess="R/W1TC"/> 
		<bitfield id="RINGACC_STRAM_RAMECC_ENABLE_CLR" width="1" begin="24" end="24" resetval="0x0" description="Interrupt Enable Clear Register for ringacc_stram_ramecc_pend" range="24" rwaccess="R/W1TC"/> 
		<bitfield id="MAP_RAMECC_ENABLE_CLR" width="1" begin="23" end="23" resetval="0x0" description="Interrupt Enable Clear Register for map_ramecc_pend" range="23" rwaccess="R/W1TC"/> 
		<bitfield id="SR_RAMECC_ENABLE_CLR" width="1" begin="22" end="22" resetval="0x0" description="Interrupt Enable Clear Register for sr_ramecc_pend" range="22" rwaccess="R/W1TC"/> 
		<bitfield id="BCDMA_RNGOCC_RAMECC_ENABLE_CLR" width="1" begin="21" end="21" resetval="0x0" description="Interrupt Enable Clear Register for bcdma_rngocc_ramecc_pend" range="21" rwaccess="R/W1TC"/> 
		<bitfield id="BCDMA_STS_RAMECC1_ENABLE_CLR" width="1" begin="20" end="20" resetval="0x0" description="Interrupt Enable Clear Register for bcdma_sts_ramecc1_pend" range="20" rwaccess="R/W1TC"/> 
		<bitfield id="BCDMA_STS_RAMECC0_ENABLE_CLR" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Enable Clear Register for bcdma_sts_ramecc0_pend" range="19" rwaccess="R/W1TC"/> 
		<bitfield id="BCDMA_RPCF2_RAMECC_ENABLE_CLR" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Enable Clear Register for bcdma_rpcf2_ramecc_pend" range="18" rwaccess="R/W1TC"/> 
		<bitfield id="BCDMA_RPCF1_RAMECC_ENABLE_CLR" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Enable Clear Register for bcdma_rpcf1_ramecc_pend" range="17" rwaccess="R/W1TC"/> 
		<bitfield id="BCDMA_RPCF0_RAMECC_ENABLE_CLR" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Enable Clear Register for bcdma_rpcf0_ramecc_pend" range="16" rwaccess="R/W1TC"/> 
		<bitfield id="BCDMA_TPCF1_RAMECC_ENABLE_CLR" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Enable Clear Register for bcdma_tpcf1_ramecc_pend" range="15" rwaccess="R/W1TC"/> 
		<bitfield id="BCDMA_TPCF0_RAMECC_ENABLE_CLR" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Enable Clear Register for bcdma_tpcf0_ramecc_pend" range="14" rwaccess="R/W1TC"/> 
		<bitfield id="PCFD1_RAMECC_ENABLE_CLR" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Enable Clear Register for pcfd1_ramecc_pend" range="13" rwaccess="R/W1TC"/> 
		<bitfield id="PCFD0_RAMECC_ENABLE_CLR" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Enable Clear Register for pcfd0_ramecc_pend" range="12" rwaccess="R/W1TC"/> 
		<bitfield id="BCDMA_STATE_RAMECC_ENABLE_CLR" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Enable Clear Register for bcdma_state_ramecc_pend" range="11" rwaccess="R/W1TC"/> 
		<bitfield id="BCDMA_CFG_RAMECC_ENABLE_CLR" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Enable Clear Register for bcdma_cfg_ramecc_pend" range="10" rwaccess="R/W1TC"/> 
		<bitfield id="PKTDMA_RNGOCC_RAMECC_ENABLE_CLR" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Enable Clear Register for pktdma_rngocc_ramecc_pend" range="9" rwaccess="R/W1TC"/> 
		<bitfield id="PKTDMA_STS_RAMECC1_ENABLE_CLR" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Clear Register for pktdma_sts_ramecc1_pend" range="8" rwaccess="R/W1TC"/> 
		<bitfield id="PKTDMA_STS_RAMECC0_ENABLE_CLR" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Clear Register for pktdma_sts_ramecc0_pend" range="7" rwaccess="R/W1TC"/> 
		<bitfield id="PKTDMA_RPCF2_RAMECC_ENABLE_CLR" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Clear Register for pktdma_rpcf2_ramecc_pend" range="6" rwaccess="R/W1TC"/> 
		<bitfield id="PKTDMA_RPCF1_RAMECC_ENABLE_CLR" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Clear Register for pktdma_rpcf1_ramecc_pend" range="5" rwaccess="R/W1TC"/> 
		<bitfield id="PKTDMA_RPCF0_RAMECC_ENABLE_CLR" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Clear Register for pktdma_rpcf0_ramecc_pend" range="4" rwaccess="R/W1TC"/> 
		<bitfield id="PKTDMA_TPCF1_RAMECC_ENABLE_CLR" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Clear Register for pktdma_tpcf1_ramecc_pend" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="PKTDMA_TPCF0_RAMECC_ENABLE_CLR" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Clear Register for pktdma_tpcf0_ramecc_pend" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="PKTDMA_STATE_RAMECC_ENABLE_CLR" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Clear Register for pktdma_state_ramecc_pend" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="PKTDMA_CFG_RAMECC_ENABLE_CLR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Clear Register for pktdma_cfg_ramecc_pend" range="0" rwaccess="R/W1TC"/>
	</register>
